CEKAJ: IN 0Bh ;Се вчитува податокот од порта 0Bh
       CPI 09h ;Се споредува со 09h
       JNZ CEKAJ ;Се чека да дојде податок 09h
       LXI H,POCET ;Се полни HL парот со адресата на полето
       MVI D,255 ;Бројач на податоци (не повеќе од 255)
  PАK: MOV A,M ;Првиот податок од полето се запишува во акумулатор
       CALL PRATI ;се повикува процедура за праќање
       INX H ;наредната адреса во полето
       DCR D ;еден податок е пратен
       JNZ PAK ;ако не се испратени сите врати се отпочеток
       MVI A,0Ch ;откако ќе се испратат стави вредност OCh во акумулаторот
       OUT 0Ah ;таа вредност се испраќа на адреса 0Аh
       END ;Крај на програмата
DOCNI: MVI Е, 119d ;процедура за доцнење 833µs
LOOP:  DCR Е ; 4 такта
       JNZ LOOP ;10 такта
       RET ; 14 такта * 0,5 µs = 7 µs * 119 = 833 µs
PRATI: MVI C,8h ; Треба да се праќа бит по бит
CIKL:  MOV B,A ;Привремена копија и во B регистарот
       ORI 01000000 ;Го поставуваме битот 6 на 1, останатите не ги менуваме
       SIM ;се испраќа битот 7
       CALL DOCNI ;се доцни 833 µs
       MOV A,B ;се враќа податокот во ACC
       RLC ;сега се праќа битот 6
       DCR C ;еден бит помалку за праќање
       JNZ CIKL ;Дали сме ги испратиле сите
       RET 
